{
    "data": [
        {
            "component": "mob-spacer",
            "props": {
                "style": "small"
            }
        },
        {
            "component": "mob-title",
            "props": {
                "tag": "h1",
                "isBold": true
            },
            "content": "bindClass/Style"
        },
        {
            "component": "mob-spacer",
            "props": {
                "style": "small"
            }
        },
        {
            "component": "mob-paragraph",
            "props": {
                "style": "medium"
            },
            "content": "These utilities were not developed for any specific reason:"
        },
        {
            "component": "mob-paragraph",
            "props": {
                "style": "medium"
            },
            "content": "The <span class='quote'>bindText module</span> when the conditions become too complex can simply be replaced by an <sapan class='quote'>invalidate</sapan>, different situations regarding classes and styles. In this case to have a clean bind it will be necessary to create support states going to multiply in a potentially chaotic way the states really necessary."
        },
        {
            "component": "mob-paragraph",
            "props": {
                "style": "medium"
            },
            "content": "In the real world, managing classes and styles in javascript is really simple, for example the utility <span class='quote'>classList.toggle('myclass', condition)</span> is extremely simple. Furthermore, <a href='#mobJs-refs'>refs</a> are dynamic and update automatically within <a href='#mobJs-invalidate'>invalidate</a> and <a href='#mobJs-repeat'>repeat</a>. By combining refs with the <a href='#mobJs-watch'>watch</a> and <a href='#mobJs-watchSync'>watchSync</a> functions in a very simple way, complex class and style situations can be managed, maintaining the same logic for all cases. I don't think it's necessary to implement additional utilities to manage situations that can become chaotic when in reality I don't think there's an absolute need for them."
        },
        {
            "component": "mob-paragraph",
            "props": {
                "style": "medium"
            },
            "content": "One of the key points of this work is to leave the end user (me) the freedom to go off the beaten track and be able to manage the DOM autonomously when I deem it useful or necessary, for this reason manually using the classList or style property is perfectly legal and will not cause any side effects."
        },
        {
            "component": "mob-paragraph",
            "props": {
                "style": "medium"
            },
            "content": "Maybe I'll change my mind, but at the moment I don't think it's necessary to implement additional logic to handle these cases."
        }
    ]
}
